КР3/src/Documents/ПрисвоитьРазряд/ПрисвоитьРазряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоитьРазряд</name>
  <registerRecords>InformationRegister.РазрядыУчастников</registerRecords>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядЗвание</name>
      <type>
        <types>EnumRef.РазрядыИЗвания</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КР3/src/InformationRegisters/РазрядыУчастников/РазрядыУчастников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрядыУчастников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Разряд</name>
    <type>
      <types>EnumRef.РазрядыИЗвания</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КР3/src/Documents/ПрисвоитьРазряд/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр РазрядыУчастников
	Движения.РазрядыУчастников.Записывать = Истина;
	Для Каждого ТекСтрокаУчастники Из Участники Цикл
		Движение = Движения.РазрядыУчастников.Добавить();
		Движение.Период = Дата;
		Движение.Участник = ТекСтрокаУчастники.Участник;
		Движение.ДатаПрисвоения = Дата;
		Движение.Разряд = ТекСтрокаУчастники.РазрядЗвание;
	КонецЦикла;

КонецПроцедуры
